[
  {
    "id": 1,
    "title": "2025 Mazda CX-70 Is Angling for a Specific Buyer",
    "date": "21.05.2024.",
    "text": "We're not sure of the mass-market need for a zippy, well-handling, mid-size SUV with three rows, and a very similar zippy, well-handling mid-size SUV without a third row, but Mazda is counting on there being an audience for both. The CX-70 is for those who take pleasure in being the passing vehicle on a twisty road and want to be able to do so with a bunch of stuff in the trunk but without folding any seats. The 2025 Mazda CX-70 surprised everyone at its debut in early 2024 by being not the smaller CX-60-based machine we expected, but rather a CX-90 twin with a facelift and the third row of seats removed. We took both the 340-hp 3.3-liter version and the 323-hp plug-in-hybrid for a test drive to see if the CX-70 has any major personality differences from its three-row sibling. Mazda reps are clearly tired of being asked to explain the decision of making the CX-70 its own model rather than a trim level of the CX-90. In the end, it might be an SEO move. \"There are two unique customers for three-row versus two-row,\" says Dan Aguilar, Mazda's product manager of vehicle line planning. \"We want to be on the list for both.\" With that, we'll set aside the CX-90 and look at CX-70 on its own terms. It's a mid-size SUV that's on the larger side with a 122.8-inch wheelbase and devotes itself primarily to second-row legroom and cargo space. The CX-70 has the typical Mazda SUV shape, less angular than many of the boxy designs on the road, with subtle curves that give it an attractive stance from all but the rearmost angle. It's a little bulgy from the back, but then, so are many of us. The CX-70 gets a different lower front bumper from the CX-90, and all its trim pieces are blacked out in either gloss or matte.",
    "imgURL": "https://hips.hearstapps.com/hmg-prod/images/2025-mazda-cx-70-103-664ba47100134.jpg?crop=0.526xw:0.507xh;0.437xw,0.245xh&resize=1200:*"
  },
  {
    "id": 2,
    "title": "Our 2023 Toyota Tundra Hybrid Leveled Up",
    "date": "12.05.2024.",
    "text": "It's not easy to sell full-size pickups to truck-lovin' Americans unless you're an American brand. Just ask Nissan, which pulled the plug on the Titan after two decades of trying to compete with half-ton rivals from Ford, GM, and Ram. The Toyota Tundra outsold the Nissan Titan better than threefold over the past six years, but it too lives in the shadow of the domestic sales giants. When we added a 2023 Tundra Hybrid Limited to our long-term fleet last year, we knew Toyota didn't design it to topple the Detroit Three. Yet we wondered if the reinvented Tundra could shrink the gap between itself and America's favorite pickups. After 40,000 miles, we have an answer. The Tundra got a top-to-bottom redesign for 2022 that brought a more chiseled body and a Peterbilt's schnoz. It dropped the old V-8 in favor of a trio of V-6s, adopted a sturdier ladder frame, and replaced the rear leaf springs with coil springs. The rear-suspension change helped transform the ride from jittery to buttery, especially with the optional load-leveling rear air suspension. Our Tundra was so equipped, and its smooth-driving nature received tons of logbook praise, with one staffer even comparing it to a Ram 1500—currently the benchmark in the segment. Not only did the Tundra's ride rival that of the perennial 10Best winner, whether tooling around town or shuttling families across the country, we thought it drove more like a big SUV than a body-on-frame truck. That might not be a selling point for pickup purists, but it should be for everyone else.",
    "imgURL": "https://hips.hearstapps.com/hmg-prod/images/2023-toyota-tundra-hybrid-limited-crewmax-101-664c9fa6b1714.jpg?crop=1.00xw:0.753xh;0,0.182xh&resize=1200:*"
  },
  {
    "id": 3,
    "title": "2025 Kia EV6's Refresh Revealed for Korea, Previewing U.S. Updates",
    "date": "12.04.2024.",
    "text": "The Kia EV6 has been well-liked by our staff since it debuted in 2022, and it appears to be getting a refresh for the 2025 model year. The automaker today revealed the Korean-spec version of the EV6, showcasing revised styling and a larger battery. We got to see a handful of teaser shots earlier this month, but this is our first look at the car in full. Many of the changes follow in lockstep with what we saw on the Ioniq 5 back in March. Just like with the Hyundai, the Kia's previously available 77.4-kWh battery is replaced by a new 84.0-kWh pack, which should help improve its maximum range. We expect the updated pack in the Hyundai will increase the EV6's current 303-mile estimate for rear-drive models to closer to 325 miles. The current EV6 should feature a similar increase, bringing the estimated range for rear-drive models closer to 330 miles, up from the current rating of 310. We previously put a dual-motor all-wheel-drive Wind model through our 75-mph highway fuel-economy route, and it went 230 miles on a full charge. The bigger battery marks the most substantive change for the EV6, but it's not the only update headed for the model. The most striking visual change is the updated shape of the headlights. The new units feature an angular C-shaped LED running light that wraps around the main lighting unit. Around the back of the car, the taillight retains its swooping shape but adds a new triangular swoop at either end. The GT-Line model also gets updated front and rear bumpers to help differentiate it from lesser models.",
    "imgURL": "https://hips.hearstapps.com/hmg-prod/images/2025-kia-ev6-03-664397e4e746f.jpg?crop=0.871xw:0.588xh;0.0442xw,0.263xh&resize=1200:*"
  },
  {
    "id": 4,
    "title": "1969 De Tomaso Mangusta Is Today's Bring a Trailer Pick",
    "date": "11.04.2024.",
    "text": "Alejandro de Tomaso was nothing if not full of drama, but the De Tomaso Mangusta is the most over-the-top car the mercurial Argentinian ever created. Born from a dust-up with Carroll Shelby, it even had a name designed to attract attention. Mongooses, according to Rudyard Kipling, famously hunt Cobras. The mid-engine Mangusta with its Ford V-8 was a raw, raucous race car for the road, but its shape was even more dramatic than its mechanicals. Thanks to Giorgetto Giugiaro's gorgeous lines, it still looks like a predator poised to pounce. The Mangusta didn't end up killing the Cobra and often drew criticism for being better to look at than drive, but it did put De Tomaso on the global map. Ford took notice and teamed up with the firm for the more familiar (and refined) Pantera in 1971. Before that, 401 Mangustas were made, including this 1969 example for sale on Bring a Trailer (which, like Car and Driver, is part of Hearst Autos). Amazingly, the Mangusta was only De Tomaso's second road car, and the first built in quantity. Both accomplished racers, de Tomaso and his American wife, Isabelle Haskell, founded De Tomaso Automobili in 1959 to make competition cars. To woo investors and partners, they launched a road car, the Ford Cortina–powered Vallelunga, in 1963. It worked. Among the many projects De Tomaso was working on by 1964 was the P70 racer. Designed for Shelby with help from designer Pete Brock and meant for the U.S. Road Racing Championship, it would use the Vallelunga's backbone chassis and a 427-cubic-inch version of Ford's 289-cubic-inch V-8. De Tomaso wasn't able to stretch Ford's small-block that far and couldn't build the car in time for the 1965 racing season, so a frustrated Shelby pulled out.",
    "imgURL": "https://hips.hearstapps.com/hmg-prod/images/1969-detomaso-mangusta-bat-101-66464f5525df4.jpg?crop=0.548xw:0.462xh;0.162xw,0.355xh&resize=1200:*"
  },
  {
    "id": 5,
    "title": "McLaren Senna Sempre Livery Pays Homage to the Legendary Racer",
    "date": "21.03.2024.",
    "text": "It's been 30 years since Ayrton Senna died during the San Marino Grand Prix. Now McLaren is honoring the late driver by running a Senna-inspired livery on both MCL38 race cars at the Monaco Grand Prix on May 26 to mark the occasion. While Senna was driving for Williams at the time of his death, he spent a very productive five years at McLaren from 1988 to 1993, winning three Formula 1 world championships in that time. He remains such an important part of McLaren's history that the brand dedicated its fiercest car after the driver. Fittingly, in addition to the F1 cars, McLaren pulled a pre-production Senna hypercar from its heritage collection and gave it a matching hand-painted livery it is calling \"Senna Sempre\" meaning Senna Always. Both the race cars and the road car take on the colors of Senna's national flag of Brazil, using yellow, green, and blue throughout each livery. The prominent yellow on the race cars is broken up with a blue stripe and green stripe and is reminiscent of Senna's personal race helmet. According to McLaren, the livery on the road car was hand-painted by its in-house Special Operations team team. The car is littered with tribute messages throughout the paintwork. The 'double S' logo is painted on the wing endplates as well as on the hood of the car. The sides of the car feature opposing paintings of Senna, both in and out of his race car. Inside the car, the door panels are marked with a signature and quote by the driver reading: \"I have no idols. I admire work, dedication and competence.\"",
    "imgURL": "https://hips.hearstapps.com/hmg-prod/images/mclarensennasempre-03-664cb9e12b2d3.jpg?crop=1xw:0.84375xh;center,top&resize=1200:*"
  },
  {
    "id": 6,
    "title": "Mitsubishi to Move Forward with a Blend of Hybrids, PHEVs, and EVs",
    "date": "04.03.2024.",
    "text": "Mitsubishi won't have to stress the next time someone asks \"Where do you see yourself in five years?\" Following a meeting with its national dealership group, Mitsubishi revealed a new five-year plan called \"Mitsubishi Motors Momentum 2030\" that outlines electrification, a growing vehicle lineup, and an expanded retail market. According to the brand, Momentum 2030 is defined by four key points: creating a path towards electrification, refreshing and expanding Mitsubishi's North American lineup, modernizing the sales model, and expanding the sales network. Given that the first two points work hand-in-hand and are more product-focused, we're more concerned with them. Part of Mitsubishi's path towards electrification has already been revealed. Back in March, the brand announced a series of new vehicles to be produced in partnership with Nissan, including a new EV, and a jointly developed mid-size pickup truck to be built in Mexico. The brand currently sells one PHEV in the form of the Outlander Hybrid, though that model suffers from an outdated CHAdeMO charging port meaning you might struggle to find reliable local fast-charging. During the dealer meeting earlier this week, Mark Chaffin, Mitsubishi Motors North America president and CEO, explained how Momentum 2030 hinges on the brand adding hybrids, plug-in hybrids, and battery electric vehicles. The automaker plans to release one new or completely refreshed model each fiscal year between 2026 and 2030, doubling the size of the existing lineup. According to Chaffin, two of the new models enter segments that Mitsubishi doesn't currently occupy in North America. One of those will almost certainly be the mid-size pickup it's building in collaboration with Nissan. The other new model appears to be a production version of the D:X Delica van which could come to the U.S. market. We're here for that.",
    "imgURL": "https://hips.hearstapps.com/hmg-prod/images/line-up-teaser-38-6647757ccb6ad.jpg?crop=0.8842407464369937xw:1xh;center,top&resize=1200:*"
  },
  {
    "id": 7,
    "title": "Confirmed: BMW Scraps the 'i' in Names of Its Gas-Powered Cars",
    "date": "07.02.2024.",
    "text": "It's official: at BMW, the i's have had it. The new 2025 X3 M50 that replaces the previous X3 M40i drops its \"i\" suffix, and more combustion-engined BMWs will follow. As first reported on the fan site BMW Blog, senior BMW vice president Bernd Körber indicated that the historic i designation would now be found only as a prefix on the names of EV models going forward. BMW's media relations team has confirmed to C/D that the change is coming. \"Historically, even though our interpretation of BMW i was always different, it’s more innovation, not necessarily only electric, and we historically had injection at the end [of the badge],\" Körber told BMW Blog. \"We said, we would like to keep 'i' as an asset, and we would like to keep it as a signature to indicate you're driving an electric car and that was the logic that we had.\" BMW's first dalliances with fuel injection were, of course, in aviation applications. The first BMW road cars to wear an \"i\" suffix weren't actually fuel injected; in the 1963 1800ti, the t stands for touring and the i for international. Later, as with the 1971 3.0CSi, the i was indeed intended to indicate that the Bimmer in question had fuel injectors instead of carburetors.",
    "imgURL": "https://hips.hearstapps.com/hmg-prod/images/2025-bmw-m440i-coupe-taillights-65b931da14c8a.jpg?crop=0.839xw:0.707xh;0.00518xw,0.210xh&resize=1200:*"
  },
  {
    "id": 8,
    "title": "Aston Martin's New 824-HP Twin-Turbo V-12 Will Power a Forthcoming Flagship",
    "date": "30.01.2024.",
    "text": "As more and more V-12 engines approach their expiration date, Aston Martin is preparing to introduce a fresh one. The British marque today revealed the first details about its new twin-turbocharged 12-cylinder, which it says is completely redesigned. Not only that, but the hand-built mill will make 824 horsepower and 738 pound-feet of torque, meaning it's a lot more powerful than the 5.2-liter V-12 it will replace. The outgoing version of Aston's V-12 peaked with the 759-hp engine under the long hood of the DBS 770 Ultimate, which both retired that generation and represented the most powerful production car the company has ever built. Obviously, that title will be broken when the new V-12 arrives. To tease the reveal, Aston released a short video of what it's calling the \"Dawn of a new V-12 era.\" Among the myriad changes that were made to the upcoming V-12 are a stronger engine block and connecting rods. The cylinder heads have also been redesigned, and Aston says there are higher-speed, reduced-inertia turbochargers. The valvetrain receives revised camshaft profiles as well as new intake and exhaust ports. The V-12's fuel system will feature injectors with a higher flow rate, and the spark plugs have also been repositioned. Aston has previously said it remains committed to building 12-cylinder engines until 2026. The introduction of this new V-12 verifies that promise. And Aston says it'll debut in a new flagship model that'll break cover sometime later this year. At that time, we'll also learn more technical details about the engine that weren't included in today's reveal like its displacement. As expected, the company says the new V-12 will be built by hand in a limited capacity on a year-by-year basis.",
    "imgURL": "https://hips.hearstapps.com/hmg-prod/images/the-dawn-of-a-new-v12-era-01-662ffae41954c.jpg?crop=1.00xw:0.790xh;0,0.0762xh&resize=1200:*"
  }
]